Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/Atmel.SAM4S_DFP.pdsc
      <condition id="ATSAM4S16C">
         <require Dvendor="Atmel:3" Dname="ATSAM4S16C"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4SD32B">
         <require Dvendor="Atmel:3" Dname="ATSAM4SD32B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4S8B">
         <require Dvendor="Atmel:3" Dname="ATSAM4S8B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4S8C">
         <require Dvendor="Atmel:3" Dname="ATSAM4S8C"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4SA16B">
         <require Dvendor="Atmel:3" Dname="ATSAM4SA16B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4SA16C">
         <require Dvendor="Atmel:3" Dname="ATSAM4SA16C"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4SD16C">
         <require Dvendor="Atmel:3" Dname="ATSAM4SD16C"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4SD16B">
         <require Dvendor="Atmel:3" Dname="ATSAM4SD16B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4S2A">
         <description>Headers and startup code for Atmel ATSAM4S2A</description>
         <files>
            <file condition="C" category="include" name="sam4s/include"/>
            <file condition="C" category="header" name="sam4s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/system_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/gcc/startup_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4s/gcc/gcc/sam4s2a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s2a_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/ARM/startup_SAM4S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/system_SAM4S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4S2B">
         <description>Headers and startup code for Atmel ATSAM4S2B</description>
         <files>
            <file condition="C" category="include" name="sam4s/include"/>
            <file condition="C" category="header" name="sam4s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/system_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/gcc/startup_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4s/gcc/gcc/sam4s2b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s2b_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/ARM/startup_SAM4S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/system_SAM4S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4S2C">
         <description>Headers and startup code for Atmel ATSAM4S2C</description>
         <files>
            <file condition="C" category="include" name="sam4s/include"/>
            <file condition="C" category="header" name="sam4s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/system_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/gcc/startup_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4s/gcc/gcc/sam4s2c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s2c_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/ARM/startup_SAM4S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/system_SAM4S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4S4B">
         <description>Headers and startup code for Atmel ATSAM4S4B</description>
         <files>
            <file condition="C" category="include" name="sam4s/include"/>
            <file condition="C" category="header" name="sam4s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/system_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/gcc/startup_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4s/gcc/gcc/sam4s4b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s4b_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/ARM/startup_SAM4S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/system_SAM4S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4S4C">
         <description>Headers and startup code for Atmel ATSAM4S4C</description>
         <files>
            <file condition="C" category="include" name="sam4s/include"/>
            <file condition="C" category="header" name="sam4s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/system_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/gcc/startup_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4s/gcc/gcc/sam4s4c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s4c_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/ARM/startup_SAM4S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/system_SAM4S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4SP32A">
         <description>Headers and startup code for Atmel ATSAM4SP32A</description>
         <files>
            <file condition="C" category="include" name="sam4sp/include"/>
            <file condition="C" category="header" name="sam4sp/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4sp/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4sp/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4sp/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4sp/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4sp/gcc/system_sam4sp.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4sp/gcc/gcc/startup_sam4sp.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4sp/gcc/gcc/sam4sp32a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4sp/gcc/gcc/sam4sp32a_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4sp/gcc/gcc/sam4sp_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4sp/gcc/gcc/sam4sp_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4sp/armcc/Device/Source/ARM/startup_sam4sp.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4sp/armcc/Device/Source/system_sam4sp.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4S4A">
         <description>Headers and startup code for Atmel ATSAM4S4A</description>
         <files>
            <file condition="C" category="include" name="sam4s/include"/>
            <file condition="C" category="header" name="sam4s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/system_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/gcc/startup_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4s/gcc/gcc/sam4s4a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s4a_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/ARM/startup_SAM4S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/system_SAM4S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4SD32C">
         <description>Headers and startup code for Atmel ATSAM4SD32C</description>
         <files>
            <file condition="C" category="include" name="sam4s/include"/>
            <file condition="C" category="header" name="sam4s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/system_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/gcc/startup_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4s/gcc/gcc/sam4sd32c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4sd32c_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/ARM/startup_SAM4S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/system_SAM4S.c"
                  attr="config"/>
         </files>
      </component>
