Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/Atmel.SAM4S_DFP.pdsc
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4S16B">
         <description>Headers and startup code for Atmel ATSAM4S16B</description>
         <files>
            <file condition="C" category="include" name="sam4s/include"/>
            <file condition="C" category="header" name="sam4s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/system_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/gcc/startup_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4s/gcc/gcc/sam4s16b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s16b_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/ARM/startup_SAM4S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/system_SAM4S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4S16C">
         <description>Headers and startup code for Atmel ATSAM4S16C</description>
         <files>
            <file condition="C" category="include" name="sam4s/include"/>
            <file condition="C" category="header" name="sam4s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/system_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/gcc/startup_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4s/gcc/gcc/sam4s16c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s16c_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/ARM/startup_SAM4S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/system_SAM4S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4SD32B">
         <description>Headers and startup code for Atmel ATSAM4SD32B</description>
         <files>
            <file condition="C" category="include" name="sam4s/include"/>
            <file condition="C" category="header" name="sam4s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/system_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/gcc/startup_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4s/gcc/gcc/sam4sd32b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4sd32b_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/ARM/startup_SAM4S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/system_SAM4S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4S8B">
         <description>Headers and startup code for Atmel ATSAM4S8B</description>
         <files>
            <file condition="C" category="include" name="sam4s/include"/>
            <file condition="C" category="header" name="sam4s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/system_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/gcc/startup_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4s/gcc/gcc/sam4s8b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s8b_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/ARM/startup_SAM4S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/system_SAM4S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4S8C">
         <description>Headers and startup code for Atmel ATSAM4S8C</description>
         <files>
            <file condition="C" category="include" name="sam4s/include"/>
            <file condition="C" category="header" name="sam4s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/system_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/gcc/startup_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4s/gcc/gcc/sam4s8c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s8c_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/ARM/startup_SAM4S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/system_SAM4S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4SA16B">
         <description>Headers and startup code for Atmel ATSAM4SA16B</description>
         <files>
            <file condition="C" category="include" name="sam4s/include"/>
            <file condition="C" category="header" name="sam4s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/system_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/gcc/startup_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4s/gcc/gcc/sam4sa16b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4sa16b_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/ARM/startup_SAM4S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/system_SAM4S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4SA16C">
         <description>Headers and startup code for Atmel ATSAM4SA16C</description>
         <files>
            <file condition="C" category="include" name="sam4s/include"/>
            <file condition="C" category="header" name="sam4s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/system_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/gcc/startup_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4s/gcc/gcc/sam4sa16c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4sa16c_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/ARM/startup_SAM4S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/system_SAM4S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4SD16C">
         <description>Headers and startup code for Atmel ATSAM4SD16C</description>
         <files>
            <file condition="C" category="include" name="sam4s/include"/>
            <file condition="C" category="header" name="sam4s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/system_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/gcc/startup_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4s/gcc/gcc/sam4sd16c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4sd16c_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/ARM/startup_SAM4S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/system_SAM4S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4SD16B">
         <description>Headers and startup code for Atmel ATSAM4SD16B</description>
         <files>
            <file condition="C" category="include" name="sam4s/include"/>
            <file condition="C" category="header" name="sam4s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/system_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4s/gcc/gcc/startup_sam4s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4s/gcc/gcc/sam4sd16b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4sd16b_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4s/gcc/gcc/sam4s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/ARM/startup_SAM4S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4s/armcc/Device/Source/system_SAM4S.c"
                  attr="config"/>
         </files>
      </component>
   </components>
</package>
